#### Terraform Format and Style 🖌`failure`
<details><summary>Formatting Output</summary>

```

main.tf

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
            
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-api-fb-sbx-uks-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Api"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 5000
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/api:14"
              + memory            = "1.5"
              + name              = "api"

              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
              + env {
                  + name  = "PGUSER"
                  + value = "psqladmin"
                }
              + env {
                  + name  = "PGDATABASE"
                  + value = "postgres"
                }
              + env {
                  + name  = "PGPORT"
                  + value = "5432"
                }
              + env {
                  + name  = "PGPASSWORD"
                  + value = "p@ssw0rd!"
                }
            }
        }
    }

  # azurerm_container_app.client will be created
  + resource "azurerm_container_app" "client" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-client-fb-sbx-uks-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Client"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 3000
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/client:14"
              + memory            = "1.5"
              + name              = "client"
            }
        }
    }

  # azurerm_container_app.nginx will be created
  + resource "azurerm_container_app" "nginx" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-nginx-fb-sbx-uks-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "NGinx"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/nginx:14"
              + memory            = "1.5"
              + name              = "nginx"
            }
        }
    }

  # azurerm_container_app.worker will be created
  + resource "azurerm_container_app" "worker" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-worker-fb-sbx-uks-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Worker"
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/worker:14"
              + memory            = "2.0"
              + name              = "worker"

              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
            }
        }
    }

  # azurerm_container_app_environment.this must be replaced
-/+ resource "azurerm_container_app_environment" "this" {
      ~ custom_domain_verification_id               = "41C084045B053957F022857FFAE0B988908646EE8D456298D43469761C7FB37C" -> (known after apply)
      ~ default_domain                              = "livelyglacier-7b2381a7.uksouth.azurecontainerapps.io" -> (known after apply)
      + docker_bridge_cidr                          = (known after apply)
      ~ id                                          = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.App/managedEnvironments/cae-fibonacci-sbx-uksouth-5ff115e9" -> (known after apply)
      - infrastructure_resource_group_name          = "ME_cae-fibonacci-sbx-uksouth-5ff115e9_rg-fibonacci-sbx-uksouth-5ff115e9_uksouth" -> null
      ~ infrastructure_subnet_id                    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/cae" # forces replacement -> (known after apply) # forces replacement
      ~ name                                        = "cae-fibonacci-sbx-uksouth-5ff115e9" -> "cae-fb-sbx-uks-5ff115e9" # forces replacement
      + platform_reserved_cidr                      = (known after apply)
      + platform_reserved_dns_ip_address            = (known after apply)
      ~ resource_group_name                         = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      ~ static_ip_address                           = "85.210.37.141" -> (known after apply)
        tags                                        = {
            "environment" = "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Container App Environment"
        }
        # (6 unchanged attributes hidden)

      - workload_profile {
          - maximum_count         = 0 -> null
          - minimum_count         = 0 -> null
          - name                  = "Consumption" -> null
          - workload_profile_type = "Consumption" -> null
        }
      + workload_profile {
          + maximum_count         = 2
          + minimum_count         = 1
          + name                  = "Consumption"
          + workload_profile_type = "Consumption"
        }
    }

  # azurerm_private_dns_zone.psql must be replaced
-/+ resource "azurerm_private_dns_zone" "psql" {
      ~ id                                                    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com" -> (known after apply)
      ~ max_number_of_record_sets                             = 25000 -> (known after apply)
      ~ max_number_of_virtual_network_links                   = 1000 -> (known after apply)
      ~ max_number_of_virtual_network_links_with_registration = 100 -> (known after apply)
        name                                                  = "privatelink.postgres.database.azure.com"
      ~ number_of_record_sets                                 = 1 -> (known after apply)
      ~ resource_group_name                                   = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      - tags                                                  = {} -> null

      ~ soa_record {
          + id                                                    = (known after apply)
          + max_number_of_record_sets                             = (known after apply)
          + max_number_of_virtual_network_links                   = (known after apply)
          + max_number_of_virtual_network_links_with_registration = (known after apply)
          + name                                                  = (known after apply)
          + number_of_record_sets                                 = (known after apply)
          + resource_group_name                                   = (known after apply)
          + tags                                                  = (known after apply)
        } -> (known after apply)
    }

  # azurerm_private_dns_zone.redis must be replaced
-/+ resource "azurerm_private_dns_zone" "redis" {
      ~ id                                                    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net" -> (known after apply)
      ~ max_number_of_record_sets                             = 25000 -> (known after apply)
      ~ max_number_of_virtual_network_links                   = 1000 -> (known after apply)
      ~ max_number_of_virtual_network_links_with_registration = 100 -> (known after apply)
        name                                                  = "privatelink.redis.cache.windows.net"
      ~ number_of_record_sets                                 = 1 -> (known after apply)
      ~ resource_group_name                                   = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      - tags                                                  = {} -> null

      ~ soa_record {
          + id                                                    = (known after apply)
          + max_number_of_record_sets                             = (known after apply)
          + max_number_of_virtual_network_links                   = (known after apply)
          + max_number_of_virtual_network_links_with_registration = (known after apply)
          + name                                                  = (known after apply)
          + number_of_record_sets                                 = (known after apply)
          + resource_group_name                                   = (known after apply)
          + tags                                                  = (known after apply)
        } -> (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.psql must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "psql" {
      ~ id                    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com/virtualNetworkLinks/psql" -> (known after apply)
        name                  = "psql"
      ~ resource_group_name   = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      - tags                  = {} -> null
      ~ virtual_network_id    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_private_dns_zone_virtual_network_link.redis must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "redis" {
      ~ id                    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/virtualNetworkLinks/redis" -> (known after apply)
        name                  = "redis"
      ~ resource_group_name   = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      - tags                  = {} -> null
      ~ virtual_network_id    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_redis_cache.this must be replaced
-/+ resource "azurerm_redis_cache" "this" {
      ~ hostname                      = "redis-fibonacci-sbx-uksouth-5ff115e9.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Cache/redis/redis-fibonacci-sbx-uksouth-5ff115e9" -> (known after apply)
      ~ name                          = "redis-fibonacci-sbx-uksouth-5ff115e9" -> "redis-fb-sbx-uks-5ff115e9" # forces replacement
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> (known after apply)
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ resource_group_name           = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
      - tags                          = {} -> null
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (8 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 1000 -> (known after apply)
          ~ maxfragmentationmemory_reserved         = 125 -> (known after apply)
          ~ maxmemory_delta                         = 125 -> (known after apply)
          ~ maxmemory_reserved                      = 125 -> (known after apply)
          - rdb_backup_enabled                      = false -> null
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (8 unchanged attributes hidden)
        }
    }

  # azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id         = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9" -> (known after apply)
      ~ name       = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
        tags       = {
            "environment" = "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Container App Environment"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_subnet.cae must be replaced
-/+ resource "azurerm_subnet" "cae" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/cae" -> (known after apply)
        name                                           = "cae"
      ~ private_endpoint_network_policies              = "Enabled" -> (known after apply)
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-fibonacci-sbx-uksouth-5ff115e9" -> "vnet-fb-sbx-uks-5ff115e9" # forces replacement
        # (2 unchanged attributes hidden)

      ~ delegation {
            name = "cae"

          ~ service_delegation {
              ~ actions = [
                  ~ "Microsoft.Network/virtualNetworks/subnets/join/action" -> "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.App/environments"
            }
        }
    }

  # azurerm_subnet.pe must be replaced
-/+ resource "azurerm_subnet" "pe" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/pe" -> (known after apply)
        name                                           = "pe"
      ~ private_endpoint_network_policies              = "Enabled" -> (known after apply)
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-fibonacci-sbx-uksouth-5ff115e9" -> "vnet-fb-sbx-uks-5ff115e9" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_subnet.psql must be replaced
-/+ resource "azurerm_subnet" "psql" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/psql" -> (known after apply)
        name                                           = "psql"
      ~ private_endpoint_network_policies              = "Enabled" -> (known after apply)
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      ~ virtual_network_name                           = "vnet-fibonacci-sbx-uksouth-5ff115e9" -> "vnet-fb-sbx-uks-5ff115e9" # forces replacement
        # (3 unchanged attributes hidden)

      ~ delegation {
            name = "psql"

          ~ service_delegation {
              ~ actions = [
                  ~ "Microsoft.Network/virtualNetworks/subnets/join/action" -> "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # azurerm_subnet.redis must be replaced
-/+ resource "azurerm_subnet" "redis" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/redis" -> (known after apply)
        name                                           = "redis"
      ~ private_endpoint_network_policies              = "Enabled" -> (known after apply)
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-fibonacci-sbx-uksouth-5ff115e9" -> "vnet-fb-sbx-uks-5ff115e9" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_virtual_network.this must be replaced
-/+ resource "azurerm_virtual_network" "this" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "2a530a45-3965-4aa8-8987-65f92ee7d7c3" -> (known after apply)
      ~ id                      = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9" -> (known after apply)
      ~ name                    = "vnet-fibonacci-sbx-uksouth-5ff115e9" -> "vnet-fb-sbx-uks-5ff115e9" # forces replacement
      ~ resource_group_name     = "rg-fibonacci-sbx-uksouth-5ff115e9" -> "rg-fb-sbx-uks-5ff115e9" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "192.168.0.0/21"
              - id             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/cae"
              - name           = "cae"
                # (1 unchanged attribute hidden)
            },
          - {
              - address_prefix = "192.168.10.0/24"
              - id             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/redis"
              - name           = "redis"
                # (1 unchanged attribute hidden)
            },
          - {
              - address_prefix = "192.168.8.0/24"
              - id             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/pe"
              - name           = "pe"
                # (1 unchanged attribute hidden)
            },
          - {
              - address_prefix = "192.168.9.0/24"
              - id             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/psql"
              - name           = "psql"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        tags                    = {
            "environment" = "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Networking"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 16 to add, 0 to change, 12 to destroy.

```

</details>

Pusher: @heathen1878
Action: pull_request
Workflow: Validate Fibonacci Infrastructure